FKDD_COPY_DIFF_3_2026-02-14/Documents/ТТ_План_ЗП_Сервис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТТ_План_ЗП_Сервис</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТТ_ПланыЗП_Сервис</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Планы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТТ_Параметры_ЗП_Сервис</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/ТТ_План_ЗП_Сервис/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для каждого Стр из Планы Цикл

		НаборЗаписей= Движения.ТТ_ПланыЗП_Сервис;
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период=Дата;
				НоваяЗапись.Регистратор=ЭтотОбъект;
				НоваяЗапись.Сотрудник=Стр.Сотрудник;
				НоваяЗапись.Должность=Стр.Должность;
				НоваяЗапись.Параметр=Стр.Параметр;
				НоваяЗапись.Подразделение=Стр.Подразделение;
				НоваяЗапись.Значение=Стр.Значение;
		НаборЗаписей.Записать();
	КонецЦикла;
	

КонецПроцедуры
